Tekla.Structures.CatalogInternal.dotcatMaterialItem_t
Serialization structure for MaterialItem.

Tekla.Structures.CatalogInternal.dotcatMaterialItem_t.MaterialName
The name of the material.

Tekla.Structures.CatalogInternal.dotcatMaterialItem_t.AliasName1
The alias name 1 of the material.

Tekla.Structures.CatalogInternal.dotcatMaterialItem_t.AliasName2
The alias name 2 of the material.

Tekla.Structures.CatalogInternal.dotcatMaterialItem_t.AliasName3
The alias name 3 of the material.

Tekla.Structures.CatalogInternal.dotcatMaterialItem_t.MaterialType
The profile item type.

Tekla.Structures.CatalogInternal.dotcatMaterialItem_t.ProfileDensity
The profile density in unit kg/m3.

Tekla.Structures.CatalogInternal.dotcatMaterialItem_t.PlateDensity
The plate density in unit kg/m3.

Tekla.Structures.CatalogInternal.dotcatMaterialItem_t.ModulusOfElasticity
Thte modulus of elasticity in unit N/m2.

Tekla.Structures.CatalogInternal.dotcatMaterialItem_t.PoissonsRatio
The poissons ratio

Tekla.Structures.CatalogInternal.dotcatMaterialItem_t.ThermalDilatation
The thermal dilatation in unit 1/K.

Tekla.Structures.CatalogInternal.dotcatMaterialItem_t.DesignCode
The design code.